espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_gpio.h
typedef struct {
  __IOM uint32_t ROUTEEN;                            /**< LETIMER pin enable                                 */
  __IOM uint32_t OUT0ROUTE;                          /**< OUT0 port/pin select                               */
  __IOM uint32_t OUT1ROUTE;                          /**< OUT1 port/pin select                               */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
} GPIO_LETIMERROUTE_TypeDef;

typedef struct {
  __IOM uint32_t ROUTEEN;                            /**< MODEM pin enable                                   */
  __IOM uint32_t ANT0ROUTE;                          /**< ANT0 port/pin select                               */
  __IOM uint32_t ANT1ROUTE;                          /**< ANT1 port/pin select                               */
  __IOM uint32_t ANTROLLOVERROUTE;                   /**< ANTROLLOVER port/pin select                        */
  __IOM uint32_t ANTRR0ROUTE;                        /**< ANTRR0 port/pin select                             */
  __IOM uint32_t ANTRR1ROUTE;                        /**< ANTRR1 port/pin select                             */
  __IOM uint32_t ANTRR2ROUTE;                        /**< ANTRR2 port/pin select                             */
  __IOM uint32_t ANTRR3ROUTE;                        /**< ANTRR3 port/pin select                             */
  __IOM uint32_t ANTRR4ROUTE;                        /**< ANTRR4 port/pin select                             */
  __IOM uint32_t ANTRR5ROUTE;                        /**< ANTRR5 port/pin select                             */
  __IOM uint32_t ANTSWENROUTE;                       /**< ANTSWEN port/pin select                            */
  __IOM uint32_t ANTSWUSROUTE;                       /**< ANTSWUS port/pin select                            */
  __IOM uint32_t ANTTRIGROUTE;                       /**< ANTTRIG port/pin select                            */
  __IOM uint32_t ANTTRIGSTOPROUTE;                   /**< ANTTRIGSTOP port/pin select                        */
  __IOM uint32_t DCLKROUTE;                          /**< DCLK port/pin select                               */
  __IOM uint32_t DINROUTE;                           /**< DIN port/pin select                                */
  __IOM uint32_t DOUTROUTE;                          /**< DOUT port/pin select                               */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
} GPIO_MODEMROUTE_TypeDef;

typedef struct {
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t S0INROUTE;                          /**< S0IN port/pin select                               */
  __IOM uint32_t S1INROUTE;                          /**< S1IN port/pin select                               */
  uint32_t       RESERVED1[1U];                      /**< Reserved for future use                            */
} GPIO_PCNTROUTE_TypeDef;

typedef struct {
  __IOM uint32_t ROUTEEN;                            /**< PRS0 pin enable                                    */
  __IOM uint32_t ASYNCH0ROUTE;                       /**< ASYNCH0 port/pin select                            */
  __IOM uint32_t ASYNCH1ROUTE;                       /**< ASYNCH1 port/pin select                            */
  __IOM uint32_t ASYNCH2ROUTE;                       /**< ASYNCH2 port/pin select                            */
  __IOM uint32_t ASYNCH3ROUTE;                       /**< ASYNCH3 port/pin select                            */
  __IOM uint32_t ASYNCH4ROUTE;                       /**< ASYNCH4 port/pin select                            */
  __IOM uint32_t ASYNCH5ROUTE;                       /**< ASYNCH5 port/pin select                            */
  __IOM uint32_t ASYNCH6ROUTE;                       /**< ASYNCH6 port/pin select                            */
  __IOM uint32_t ASYNCH7ROUTE;                       /**< ASYNCH7 port/pin select                            */
  __IOM uint32_t ASYNCH8ROUTE;                       /**< ASYNCH8 port/pin select                            */
  __IOM uint32_t ASYNCH9ROUTE;                       /**< ASYNCH9 port/pin select                            */
  __IOM uint32_t ASYNCH10ROUTE;                      /**< ASYNCH10 port/pin select                           */
  __IOM uint32_t ASYNCH11ROUTE;                      /**< ASYNCH11 port/pin select                           */
  __IOM uint32_t SYNCH0ROUTE;                        /**< SYNCH0 port/pin select                             */
  __IOM uint32_t SYNCH1ROUTE;                        /**< SYNCH1 port/pin select                             */
  __IOM uint32_t SYNCH2ROUTE;                        /**< SYNCH2 port/pin select                             */
  __IOM uint32_t SYNCH3ROUTE;                        /**< SYNCH3 port/pin select                             */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
} GPIO_PRSROUTE_TypeDef;

typedef struct {
  __IOM uint32_t ROUTEEN;                            /**< RFECA0 pin enable                                  */
  __IOM uint32_t DATAOUT0ROUTE;                      /**< DATAOUT0 port/pin select                           */
  __IOM uint32_t DATAOUT1ROUTE;                      /**< DATAOUT1 port/pin select                           */
  __IOM uint32_t DATAOUT2ROUTE;                      /**< DATAOUT2 port/pin select                           */
  __IOM uint32_t DATAOUT3ROUTE;                      /**< DATAOUT3 port/pin select                           */
  __IOM uint32_t DATAOUT4ROUTE;                      /**< DATAOUT4 port/pin select                           */
  __IOM uint32_t DATAOUT5ROUTE;                      /**< DATAOUT5 port/pin select                           */
  __IOM uint32_t DATAOUT6ROUTE;                      /**< DATAOUT6 port/pin select                           */
  __IOM uint32_t DATAOUT7ROUTE;                      /**< DATAOUT7 port/pin select                           */
  __IOM uint32_t DATAOUT8ROUTE;                      /**< DATAOUT8 port/pin select                           */
  __IOM uint32_t DATAOUT9ROUTE;                      /**< DATAOUT9 port/pin select                           */
  __IOM uint32_t DATAOUT10ROUTE;                     /**< DATAOUT10 port/pin select                          */
  __IOM uint32_t DATAOUT11ROUTE;                     /**< DATAOUT11 port/pin select                          */
  __IOM uint32_t DATAOUT12ROUTE;                     /**< DATAOUT12 port/pin select                          */
  __IOM uint32_t DATAOUT13ROUTE;                     /**< DATAOUT13 port/pin select                          */
  __IOM uint32_t DATAOUT14ROUTE;                     /**< DATAOUT14 port/pin select                          */
  __IOM uint32_t DATAOUT15ROUTE;                     /**< DATAOUT15 port/pin select                          */
  __IOM uint32_t DATAOUT16ROUTE;                     /**< DATAOUT16 port/pin select                          */
  __IOM uint32_t DATAOUT17ROUTE;                     /**< DATAOUT17 port/pin select                          */
  __IOM uint32_t DATAOUT18ROUTE;                     /**< DATAOUT18 port/pin select                          */
  __IOM uint32_t DATAVALIDROUTE;                     /**< DATAVALID port/pin select                          */
  __IOM uint32_t TRIGGERINROUTE;                     /**< TRIGGERIN port/pin select                          */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
} GPIO_RFECAROUTE_TypeDef;

