espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_gpio.h
/* Bit fields for GPIO AEVEN1SWITCH */
#define _GPIO_AEVEN1SWITCH_RESETVALUE                    0x00000000UL                                   /**< Default value for GPIO_AEVEN1SWITCH         */
#define _GPIO_AEVEN1SWITCH_MASK                          0x0000003FUL                                   /**< Mask for GPIO_AEVEN1SWITCH                  */
#define _GPIO_AEVEN1SWITCH_AEVEN1SWITCH_SHIFT            0                                              /**< Shift value for GPIO_AEVEN1SWITCH           */
#define _GPIO_AEVEN1SWITCH_AEVEN1SWITCH_MASK             0x3FUL                                         /**< Bit mask for GPIO_AEVEN1SWITCH              */
#define _GPIO_AEVEN1SWITCH_AEVEN1SWITCH_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_AEVEN1SWITCH          */
#define GPIO_AEVEN1SWITCH_AEVEN1SWITCH_DEFAULT           (_GPIO_AEVEN1SWITCH_AEVEN1SWITCH_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_AEVEN1SWITCH  */

/* Bit fields for GPIO BODD0SWITCH */
#define _GPIO_BODD0SWITCH_RESETVALUE                     0x00000000UL                                 /**< Default value for GPIO_BODD0SWITCH          */
#define _GPIO_BODD0SWITCH_MASK                           0x0000000FUL                                 /**< Mask for GPIO_BODD0SWITCH                   */
#define _GPIO_BODD0SWITCH_BODD0SWITCH_SHIFT              0                                            /**< Shift value for GPIO_BODD0SWITCH            */
#define _GPIO_BODD0SWITCH_BODD0SWITCH_MASK               0xFUL                                        /**< Bit mask for GPIO_BODD0SWITCH               */
#define _GPIO_BODD0SWITCH_BODD0SWITCH_DEFAULT            0x00000000UL                                 /**< Mode DEFAULT for GPIO_BODD0SWITCH           */
#define GPIO_BODD0SWITCH_BODD0SWITCH_DEFAULT             (_GPIO_BODD0SWITCH_BODD0SWITCH_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_BODD0SWITCH   */

/* Bit fields for GPIO BODD1SWITCH */
#define _GPIO_BODD1SWITCH_RESETVALUE                     0x00000000UL                                 /**< Default value for GPIO_BODD1SWITCH          */
#define _GPIO_BODD1SWITCH_MASK                           0x0000000FUL                                 /**< Mask for GPIO_BODD1SWITCH                   */
#define _GPIO_BODD1SWITCH_BODD1SWITCH_SHIFT              0                                            /**< Shift value for GPIO_BODD1SWITCH            */
#define _GPIO_BODD1SWITCH_BODD1SWITCH_MASK               0xFUL                                        /**< Bit mask for GPIO_BODD1SWITCH               */
#define _GPIO_BODD1SWITCH_BODD1SWITCH_DEFAULT            0x00000000UL                                 /**< Mode DEFAULT for GPIO_BODD1SWITCH           */
#define GPIO_BODD1SWITCH_BODD1SWITCH_DEFAULT             (_GPIO_BODD1SWITCH_BODD1SWITCH_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_BODD1SWITCH   */

/* Bit fields for GPIO BEVEN0SWITCH */
#define _GPIO_BEVEN0SWITCH_RESETVALUE                    0x00000000UL                                   /**< Default value for GPIO_BEVEN0SWITCH         */
#define _GPIO_BEVEN0SWITCH_MASK                          0x0000001FUL                                   /**< Mask for GPIO_BEVEN0SWITCH                  */
#define _GPIO_BEVEN0SWITCH_BEVEN0SWITCH_SHIFT            0                                              /**< Shift value for GPIO_BEVEN0SWITCH           */
#define _GPIO_BEVEN0SWITCH_BEVEN0SWITCH_MASK             0x1FUL                                         /**< Bit mask for GPIO_BEVEN0SWITCH              */
#define _GPIO_BEVEN0SWITCH_BEVEN0SWITCH_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_BEVEN0SWITCH          */
#define GPIO_BEVEN0SWITCH_BEVEN0SWITCH_DEFAULT           (_GPIO_BEVEN0SWITCH_BEVEN0SWITCH_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_BEVEN0SWITCH  */

/* Bit fields for GPIO BEVEN1SWITCH */
#define _GPIO_BEVEN1SWITCH_RESETVALUE                    0x00000000UL                                   /**< Default value for GPIO_BEVEN1SWITCH         */
#define _GPIO_BEVEN1SWITCH_MASK                          0x0000001FUL                                   /**< Mask for GPIO_BEVEN1SWITCH                  */
#define _GPIO_BEVEN1SWITCH_BEVEN1SWITCH_SHIFT            0                                              /**< Shift value for GPIO_BEVEN1SWITCH           */
#define _GPIO_BEVEN1SWITCH_BEVEN1SWITCH_MASK             0x1FUL                                         /**< Bit mask for GPIO_BEVEN1SWITCH              */
#define _GPIO_BEVEN1SWITCH_BEVEN1SWITCH_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_BEVEN1SWITCH          */
#define GPIO_BEVEN1SWITCH_BEVEN1SWITCH_DEFAULT           (_GPIO_BEVEN1SWITCH_BEVEN1SWITCH_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_BEVEN1SWITCH  */

/* Bit fields for GPIO CDODD0SWITCH */
#define _GPIO_CDODD0SWITCH_RESETVALUE                    0x00000000UL                                   /**< Default value for GPIO_CDODD0SWITCH         */
#define _GPIO_CDODD0SWITCH_MASK                          0x000F001FUL                                   /**< Mask for GPIO_CDODD0SWITCH                  */
#define _GPIO_CDODD0SWITCH_CODD0SWITCH_SHIFT             0                                              /**< Shift value for GPIO_CODD0SWITCH            */
#define _GPIO_CDODD0SWITCH_CODD0SWITCH_MASK              0x1FUL                                         /**< Bit mask for GPIO_CODD0SWITCH               */
#define _GPIO_CDODD0SWITCH_CODD0SWITCH_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_CDODD0SWITCH          */
#define GPIO_CDODD0SWITCH_CODD0SWITCH_DEFAULT            (_GPIO_CDODD0SWITCH_CODD0SWITCH_DEFAULT << 0)  /**< Shifted mode DEFAULT for GPIO_CDODD0SWITCH  */
#define _GPIO_CDODD0SWITCH_DODD0SWITCH_SHIFT             16                                             /**< Shift value for GPIO_DODD0SWITCH            */
#define _GPIO_CDODD0SWITCH_DODD0SWITCH_MASK              0xF0000UL                                      /**< Bit mask for GPIO_DODD0SWITCH               */
#define _GPIO_CDODD0SWITCH_DODD0SWITCH_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_CDODD0SWITCH          */
#define GPIO_CDODD0SWITCH_DODD0SWITCH_DEFAULT            (_GPIO_CDODD0SWITCH_DODD0SWITCH_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_CDODD0SWITCH  */

/* Bit fields for GPIO CDODD1SWITCH */
#define _GPIO_CDODD1SWITCH_RESETVALUE                    0x00000000UL                                   /**< Default value for GPIO_CDODD1SWITCH         */
#define _GPIO_CDODD1SWITCH_MASK                          0x000F001FUL                                   /**< Mask for GPIO_CDODD1SWITCH                  */
#define _GPIO_CDODD1SWITCH_CODD1SWITCH_SHIFT             0                                              /**< Shift value for GPIO_CODD1SWITCH            */
#define _GPIO_CDODD1SWITCH_CODD1SWITCH_MASK              0x1FUL                                         /**< Bit mask for GPIO_CODD1SWITCH               */
#define _GPIO_CDODD1SWITCH_CODD1SWITCH_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_CDODD1SWITCH          */
#define GPIO_CDODD1SWITCH_CODD1SWITCH_DEFAULT            (_GPIO_CDODD1SWITCH_CODD1SWITCH_DEFAULT << 0)  /**< Shifted mode DEFAULT for GPIO_CDODD1SWITCH  */
#define _GPIO_CDODD1SWITCH_DODD1SWITCH_SHIFT             16                                             /**< Shift value for GPIO_DODD1SWITCH            */
#define _GPIO_CDODD1SWITCH_DODD1SWITCH_MASK              0xF0000UL                                      /**< Bit mask for GPIO_DODD1SWITCH               */
#define _GPIO_CDODD1SWITCH_DODD1SWITCH_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_CDODD1SWITCH          */
#define GPIO_CDODD1SWITCH_DODD1SWITCH_DEFAULT            (_GPIO_CDODD1SWITCH_DODD1SWITCH_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_CDODD1SWITCH  */

/* Bit fields for GPIO CDEVEN0SWITCH */
#define _GPIO_CDEVEN0SWITCH_RESETVALUE                   0x00000000UL                                     /**< Default value for GPIO_CDEVEN0SWITCH        */
#define _GPIO_CDEVEN0SWITCH_MASK                         0x000F003FUL                                     /**< Mask for GPIO_CDEVEN0SWITCH                 */
#define _GPIO_CDEVEN0SWITCH_CEVEN0SWITCH_SHIFT           0                                                /**< Shift value for GPIO_CEVEN0SWITCH           */
#define _GPIO_CDEVEN0SWITCH_CEVEN0SWITCH_MASK            0x3FUL                                           /**< Bit mask for GPIO_CEVEN0SWITCH              */
#define _GPIO_CDEVEN0SWITCH_CEVEN0SWITCH_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_CDEVEN0SWITCH         */
#define GPIO_CDEVEN0SWITCH_CEVEN0SWITCH_DEFAULT          (_GPIO_CDEVEN0SWITCH_CEVEN0SWITCH_DEFAULT << 0)  /**< Shifted mode DEFAULT for GPIO_CDEVEN0SWITCH */
#define _GPIO_CDEVEN0SWITCH_DEVEN0SWITCH_SHIFT           16                                               /**< Shift value for GPIO_DEVEN0SWITCH           */
#define _GPIO_CDEVEN0SWITCH_DEVEN0SWITCH_MASK            0xF0000UL                                        /**< Bit mask for GPIO_DEVEN0SWITCH              */
#define _GPIO_CDEVEN0SWITCH_DEVEN0SWITCH_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_CDEVEN0SWITCH         */
#define GPIO_CDEVEN0SWITCH_DEVEN0SWITCH_DEFAULT          (_GPIO_CDEVEN0SWITCH_DEVEN0SWITCH_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_CDEVEN0SWITCH */

/* Bit fields for GPIO CDEVEN1SWITCH */
#define _GPIO_CDEVEN1SWITCH_RESETVALUE                   0x00000000UL                                     /**< Default value for GPIO_CDEVEN1SWITCH        */
#define _GPIO_CDEVEN1SWITCH_MASK                         0x000F003FUL                                     /**< Mask for GPIO_CDEVEN1SWITCH                 */
#define _GPIO_CDEVEN1SWITCH_CEVEN1SWITCH_SHIFT           0                                                /**< Shift value for GPIO_CEVEN1SWITCH           */
#define _GPIO_CDEVEN1SWITCH_CEVEN1SWITCH_MASK            0x3FUL                                           /**< Bit mask for GPIO_CEVEN1SWITCH              */
#define _GPIO_CDEVEN1SWITCH_CEVEN1SWITCH_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_CDEVEN1SWITCH         */
#define GPIO_CDEVEN1SWITCH_CEVEN1SWITCH_DEFAULT          (_GPIO_CDEVEN1SWITCH_CEVEN1SWITCH_DEFAULT << 0)  /**< Shifted mode DEFAULT for GPIO_CDEVEN1SWITCH */
#define _GPIO_CDEVEN1SWITCH_DEVEN1SWITCH_SHIFT           16                                               /**< Shift value for GPIO_DEVEN1SWITCH           */
#define _GPIO_CDEVEN1SWITCH_DEVEN1SWITCH_MASK            0xF0000UL                                        /**< Bit mask for GPIO_DEVEN1SWITCH              */
#define _GPIO_CDEVEN1SWITCH_DEVEN1SWITCH_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_CDEVEN1SWITCH         */
#define GPIO_CDEVEN1SWITCH_DEVEN1SWITCH_DEFAULT          (_GPIO_CDEVEN1SWITCH_DEVEN1SWITCH_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_CDEVEN1SWITCH */

