espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_gpio.h
/* Bit fields for GPIO_RFECA ROUTEEN */
#define _GPIO_RFECA_ROUTEEN_RESETVALUE                   0x00000000UL                                     /**< Default value for GPIO_RFECA_ROUTEEN        */
#define _GPIO_RFECA_ROUTEEN_MASK                         0x000FFFFFUL                                     /**< Mask for GPIO_RFECA_ROUTEEN                 */
#define GPIO_RFECA_ROUTEEN_DATAOUT0PEN                   (0x1UL << 0)                                     /**< DATAOUT0 pin enable control bit             */
#define _GPIO_RFECA_ROUTEEN_DATAOUT0PEN_SHIFT            0                                                /**< Shift value for GPIO_DATAOUT0PEN            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT0PEN_MASK             0x1UL                                            /**< Bit mask for GPIO_DATAOUT0PEN               */
#define _GPIO_RFECA_ROUTEEN_DATAOUT0PEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT0PEN_DEFAULT           (_GPIO_RFECA_ROUTEEN_DATAOUT0PEN_DEFAULT << 0)   /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT1PEN                   (0x1UL << 1)                                     /**< DATAOUT1 pin enable control bit             */
#define _GPIO_RFECA_ROUTEEN_DATAOUT1PEN_SHIFT            1                                                /**< Shift value for GPIO_DATAOUT1PEN            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT1PEN_MASK             0x2UL                                            /**< Bit mask for GPIO_DATAOUT1PEN               */
#define _GPIO_RFECA_ROUTEEN_DATAOUT1PEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT1PEN_DEFAULT           (_GPIO_RFECA_ROUTEEN_DATAOUT1PEN_DEFAULT << 1)   /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT2PEN                   (0x1UL << 2)                                     /**< DATAOUT2 pin enable control bit             */
#define _GPIO_RFECA_ROUTEEN_DATAOUT2PEN_SHIFT            2                                                /**< Shift value for GPIO_DATAOUT2PEN            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT2PEN_MASK             0x4UL                                            /**< Bit mask for GPIO_DATAOUT2PEN               */
#define _GPIO_RFECA_ROUTEEN_DATAOUT2PEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT2PEN_DEFAULT           (_GPIO_RFECA_ROUTEEN_DATAOUT2PEN_DEFAULT << 2)   /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT3PEN                   (0x1UL << 3)                                     /**< DATAOUT3 pin enable control bit             */
#define _GPIO_RFECA_ROUTEEN_DATAOUT3PEN_SHIFT            3                                                /**< Shift value for GPIO_DATAOUT3PEN            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT3PEN_MASK             0x8UL                                            /**< Bit mask for GPIO_DATAOUT3PEN               */
#define _GPIO_RFECA_ROUTEEN_DATAOUT3PEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT3PEN_DEFAULT           (_GPIO_RFECA_ROUTEEN_DATAOUT3PEN_DEFAULT << 3)   /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT4PEN                   (0x1UL << 4)                                     /**< DATAOUT4 pin enable control bit             */
#define _GPIO_RFECA_ROUTEEN_DATAOUT4PEN_SHIFT            4                                                /**< Shift value for GPIO_DATAOUT4PEN            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT4PEN_MASK             0x10UL                                           /**< Bit mask for GPIO_DATAOUT4PEN               */
#define _GPIO_RFECA_ROUTEEN_DATAOUT4PEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT4PEN_DEFAULT           (_GPIO_RFECA_ROUTEEN_DATAOUT4PEN_DEFAULT << 4)   /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT5PEN                   (0x1UL << 5)                                     /**< DATAOUT5 pin enable control bit             */
#define _GPIO_RFECA_ROUTEEN_DATAOUT5PEN_SHIFT            5                                                /**< Shift value for GPIO_DATAOUT5PEN            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT5PEN_MASK             0x20UL                                           /**< Bit mask for GPIO_DATAOUT5PEN               */
#define _GPIO_RFECA_ROUTEEN_DATAOUT5PEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT5PEN_DEFAULT           (_GPIO_RFECA_ROUTEEN_DATAOUT5PEN_DEFAULT << 5)   /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT6PEN                   (0x1UL << 6)                                     /**< DATAOUT6 pin enable control bit             */
#define _GPIO_RFECA_ROUTEEN_DATAOUT6PEN_SHIFT            6                                                /**< Shift value for GPIO_DATAOUT6PEN            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT6PEN_MASK             0x40UL                                           /**< Bit mask for GPIO_DATAOUT6PEN               */
#define _GPIO_RFECA_ROUTEEN_DATAOUT6PEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT6PEN_DEFAULT           (_GPIO_RFECA_ROUTEEN_DATAOUT6PEN_DEFAULT << 6)   /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT7PEN                   (0x1UL << 7)                                     /**< DATAOUT7 pin enable control bit             */
#define _GPIO_RFECA_ROUTEEN_DATAOUT7PEN_SHIFT            7                                                /**< Shift value for GPIO_DATAOUT7PEN            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT7PEN_MASK             0x80UL                                           /**< Bit mask for GPIO_DATAOUT7PEN               */
#define _GPIO_RFECA_ROUTEEN_DATAOUT7PEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT7PEN_DEFAULT           (_GPIO_RFECA_ROUTEEN_DATAOUT7PEN_DEFAULT << 7)   /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT8PEN                   (0x1UL << 8)                                     /**< DATAOUT8 pin enable control bit             */
#define _GPIO_RFECA_ROUTEEN_DATAOUT8PEN_SHIFT            8                                                /**< Shift value for GPIO_DATAOUT8PEN            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT8PEN_MASK             0x100UL                                          /**< Bit mask for GPIO_DATAOUT8PEN               */
#define _GPIO_RFECA_ROUTEEN_DATAOUT8PEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT8PEN_DEFAULT           (_GPIO_RFECA_ROUTEEN_DATAOUT8PEN_DEFAULT << 8)   /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT9PEN                   (0x1UL << 9)                                     /**< DATAOUT9 pin enable control bit             */
#define _GPIO_RFECA_ROUTEEN_DATAOUT9PEN_SHIFT            9                                                /**< Shift value for GPIO_DATAOUT9PEN            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT9PEN_MASK             0x200UL                                          /**< Bit mask for GPIO_DATAOUT9PEN               */
#define _GPIO_RFECA_ROUTEEN_DATAOUT9PEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT9PEN_DEFAULT           (_GPIO_RFECA_ROUTEEN_DATAOUT9PEN_DEFAULT << 9)   /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT10PEN                  (0x1UL << 10)                                    /**< DATAOUT10 pin enable control bit            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT10PEN_SHIFT           10                                               /**< Shift value for GPIO_DATAOUT10PEN           */
#define _GPIO_RFECA_ROUTEEN_DATAOUT10PEN_MASK            0x400UL                                          /**< Bit mask for GPIO_DATAOUT10PEN              */
#define _GPIO_RFECA_ROUTEEN_DATAOUT10PEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT10PEN_DEFAULT          (_GPIO_RFECA_ROUTEEN_DATAOUT10PEN_DEFAULT << 10) /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT11PEN                  (0x1UL << 11)                                    /**< DATAOUT11 pin enable control bit            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT11PEN_SHIFT           11                                               /**< Shift value for GPIO_DATAOUT11PEN           */
#define _GPIO_RFECA_ROUTEEN_DATAOUT11PEN_MASK            0x800UL                                          /**< Bit mask for GPIO_DATAOUT11PEN              */
#define _GPIO_RFECA_ROUTEEN_DATAOUT11PEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT11PEN_DEFAULT          (_GPIO_RFECA_ROUTEEN_DATAOUT11PEN_DEFAULT << 11) /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT12PEN                  (0x1UL << 12)                                    /**< DATAOUT12 pin enable control bit            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT12PEN_SHIFT           12                                               /**< Shift value for GPIO_DATAOUT12PEN           */
#define _GPIO_RFECA_ROUTEEN_DATAOUT12PEN_MASK            0x1000UL                                         /**< Bit mask for GPIO_DATAOUT12PEN              */
#define _GPIO_RFECA_ROUTEEN_DATAOUT12PEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT12PEN_DEFAULT          (_GPIO_RFECA_ROUTEEN_DATAOUT12PEN_DEFAULT << 12) /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT13PEN                  (0x1UL << 13)                                    /**< DATAOUT13 pin enable control bit            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT13PEN_SHIFT           13                                               /**< Shift value for GPIO_DATAOUT13PEN           */
#define _GPIO_RFECA_ROUTEEN_DATAOUT13PEN_MASK            0x2000UL                                         /**< Bit mask for GPIO_DATAOUT13PEN              */
#define _GPIO_RFECA_ROUTEEN_DATAOUT13PEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT13PEN_DEFAULT          (_GPIO_RFECA_ROUTEEN_DATAOUT13PEN_DEFAULT << 13) /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT14PEN                  (0x1UL << 14)                                    /**< DATAOUT14 pin enable control bit            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT14PEN_SHIFT           14                                               /**< Shift value for GPIO_DATAOUT14PEN           */
#define _GPIO_RFECA_ROUTEEN_DATAOUT14PEN_MASK            0x4000UL                                         /**< Bit mask for GPIO_DATAOUT14PEN              */
#define _GPIO_RFECA_ROUTEEN_DATAOUT14PEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT14PEN_DEFAULT          (_GPIO_RFECA_ROUTEEN_DATAOUT14PEN_DEFAULT << 14) /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT15PEN                  (0x1UL << 15)                                    /**< DATAOUT15 pin enable control bit            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT15PEN_SHIFT           15                                               /**< Shift value for GPIO_DATAOUT15PEN           */
#define _GPIO_RFECA_ROUTEEN_DATAOUT15PEN_MASK            0x8000UL                                         /**< Bit mask for GPIO_DATAOUT15PEN              */
#define _GPIO_RFECA_ROUTEEN_DATAOUT15PEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT15PEN_DEFAULT          (_GPIO_RFECA_ROUTEEN_DATAOUT15PEN_DEFAULT << 15) /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT16PEN                  (0x1UL << 16)                                    /**< DATAOUT16 pin enable control bit            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT16PEN_SHIFT           16                                               /**< Shift value for GPIO_DATAOUT16PEN           */
#define _GPIO_RFECA_ROUTEEN_DATAOUT16PEN_MASK            0x10000UL                                        /**< Bit mask for GPIO_DATAOUT16PEN              */
#define _GPIO_RFECA_ROUTEEN_DATAOUT16PEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT16PEN_DEFAULT          (_GPIO_RFECA_ROUTEEN_DATAOUT16PEN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT17PEN                  (0x1UL << 17)                                    /**< DATAOUT17 pin enable control bit            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT17PEN_SHIFT           17                                               /**< Shift value for GPIO_DATAOUT17PEN           */
#define _GPIO_RFECA_ROUTEEN_DATAOUT17PEN_MASK            0x20000UL                                        /**< Bit mask for GPIO_DATAOUT17PEN              */
#define _GPIO_RFECA_ROUTEEN_DATAOUT17PEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT17PEN_DEFAULT          (_GPIO_RFECA_ROUTEEN_DATAOUT17PEN_DEFAULT << 17) /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAOUT18PEN                  (0x1UL << 18)                                    /**< DATAOUT18 pin enable control bit            */
#define _GPIO_RFECA_ROUTEEN_DATAOUT18PEN_SHIFT           18                                               /**< Shift value for GPIO_DATAOUT18PEN           */
#define _GPIO_RFECA_ROUTEEN_DATAOUT18PEN_MASK            0x40000UL                                        /**< Bit mask for GPIO_DATAOUT18PEN              */
#define _GPIO_RFECA_ROUTEEN_DATAOUT18PEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAOUT18PEN_DEFAULT          (_GPIO_RFECA_ROUTEEN_DATAOUT18PEN_DEFAULT << 18) /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */
#define GPIO_RFECA_ROUTEEN_DATAVALIDPEN                  (0x1UL << 19)                                    /**< DATAVALID pin enable control bit            */
#define _GPIO_RFECA_ROUTEEN_DATAVALIDPEN_SHIFT           19                                               /**< Shift value for GPIO_DATAVALIDPEN           */
#define _GPIO_RFECA_ROUTEEN_DATAVALIDPEN_MASK            0x80000UL                                        /**< Bit mask for GPIO_DATAVALIDPEN              */
#define _GPIO_RFECA_ROUTEEN_DATAVALIDPEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_RFECA_ROUTEEN         */
#define GPIO_RFECA_ROUTEEN_DATAVALIDPEN_DEFAULT          (_GPIO_RFECA_ROUTEEN_DATAVALIDPEN_DEFAULT << 19) /**< Shifted mode DEFAULT for GPIO_RFECA_ROUTEEN */

/* Bit fields for GPIO_RFECA DATAOUT0ROUTE */
#define _GPIO_RFECA_DATAOUT0ROUTE_RESETVALUE             0x00000000UL                                  /**< Default value for GPIO_RFECA_DATAOUT0ROUTE  */
#define _GPIO_RFECA_DATAOUT0ROUTE_MASK                   0x000F0003UL                                  /**< Mask for GPIO_RFECA_DATAOUT0ROUTE           */
#define _GPIO_RFECA_DATAOUT0ROUTE_PORT_SHIFT             0                                             /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT0ROUTE_PORT_MASK              0x3UL                                         /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT0ROUTE_PORT_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT0ROUTE   */
#define GPIO_RFECA_DATAOUT0ROUTE_PORT_DEFAULT            (_GPIO_RFECA_DATAOUT0ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT0ROUTE*/
#define _GPIO_RFECA_DATAOUT0ROUTE_PIN_SHIFT              16                                            /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT0ROUTE_PIN_MASK               0xF0000UL                                     /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT0ROUTE_PIN_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT0ROUTE   */
#define GPIO_RFECA_DATAOUT0ROUTE_PIN_DEFAULT             (_GPIO_RFECA_DATAOUT0ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT0ROUTE*/

