espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_gpio.h
/* Bit fields for GPIO_RFECA DATAOUT1ROUTE */
#define _GPIO_RFECA_DATAOUT1ROUTE_RESETVALUE             0x00000000UL                                  /**< Default value for GPIO_RFECA_DATAOUT1ROUTE  */
#define _GPIO_RFECA_DATAOUT1ROUTE_MASK                   0x000F0003UL                                  /**< Mask for GPIO_RFECA_DATAOUT1ROUTE           */
#define _GPIO_RFECA_DATAOUT1ROUTE_PORT_SHIFT             0                                             /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT1ROUTE_PORT_MASK              0x3UL                                         /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT1ROUTE_PORT_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT1ROUTE   */
#define GPIO_RFECA_DATAOUT1ROUTE_PORT_DEFAULT            (_GPIO_RFECA_DATAOUT1ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT1ROUTE*/
#define _GPIO_RFECA_DATAOUT1ROUTE_PIN_SHIFT              16                                            /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT1ROUTE_PIN_MASK               0xF0000UL                                     /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT1ROUTE_PIN_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT1ROUTE   */
#define GPIO_RFECA_DATAOUT1ROUTE_PIN_DEFAULT             (_GPIO_RFECA_DATAOUT1ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT1ROUTE*/

/* Bit fields for GPIO_RFECA DATAOUT2ROUTE */
#define _GPIO_RFECA_DATAOUT2ROUTE_RESETVALUE             0x00000000UL                                  /**< Default value for GPIO_RFECA_DATAOUT2ROUTE  */
#define _GPIO_RFECA_DATAOUT2ROUTE_MASK                   0x000F0003UL                                  /**< Mask for GPIO_RFECA_DATAOUT2ROUTE           */
#define _GPIO_RFECA_DATAOUT2ROUTE_PORT_SHIFT             0                                             /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT2ROUTE_PORT_MASK              0x3UL                                         /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT2ROUTE_PORT_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT2ROUTE   */
#define GPIO_RFECA_DATAOUT2ROUTE_PORT_DEFAULT            (_GPIO_RFECA_DATAOUT2ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT2ROUTE*/
#define _GPIO_RFECA_DATAOUT2ROUTE_PIN_SHIFT              16                                            /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT2ROUTE_PIN_MASK               0xF0000UL                                     /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT2ROUTE_PIN_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT2ROUTE   */
#define GPIO_RFECA_DATAOUT2ROUTE_PIN_DEFAULT             (_GPIO_RFECA_DATAOUT2ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT2ROUTE*/

/* Bit fields for GPIO_RFECA DATAOUT3ROUTE */
#define _GPIO_RFECA_DATAOUT3ROUTE_RESETVALUE             0x00000000UL                                  /**< Default value for GPIO_RFECA_DATAOUT3ROUTE  */
#define _GPIO_RFECA_DATAOUT3ROUTE_MASK                   0x000F0003UL                                  /**< Mask for GPIO_RFECA_DATAOUT3ROUTE           */
#define _GPIO_RFECA_DATAOUT3ROUTE_PORT_SHIFT             0                                             /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT3ROUTE_PORT_MASK              0x3UL                                         /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT3ROUTE_PORT_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT3ROUTE   */
#define GPIO_RFECA_DATAOUT3ROUTE_PORT_DEFAULT            (_GPIO_RFECA_DATAOUT3ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT3ROUTE*/
#define _GPIO_RFECA_DATAOUT3ROUTE_PIN_SHIFT              16                                            /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT3ROUTE_PIN_MASK               0xF0000UL                                     /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT3ROUTE_PIN_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT3ROUTE   */
#define GPIO_RFECA_DATAOUT3ROUTE_PIN_DEFAULT             (_GPIO_RFECA_DATAOUT3ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT3ROUTE*/

/* Bit fields for GPIO_RFECA DATAOUT4ROUTE */
#define _GPIO_RFECA_DATAOUT4ROUTE_RESETVALUE             0x00000000UL                                  /**< Default value for GPIO_RFECA_DATAOUT4ROUTE  */
#define _GPIO_RFECA_DATAOUT4ROUTE_MASK                   0x000F0003UL                                  /**< Mask for GPIO_RFECA_DATAOUT4ROUTE           */
#define _GPIO_RFECA_DATAOUT4ROUTE_PORT_SHIFT             0                                             /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT4ROUTE_PORT_MASK              0x3UL                                         /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT4ROUTE_PORT_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT4ROUTE   */
#define GPIO_RFECA_DATAOUT4ROUTE_PORT_DEFAULT            (_GPIO_RFECA_DATAOUT4ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT4ROUTE*/
#define _GPIO_RFECA_DATAOUT4ROUTE_PIN_SHIFT              16                                            /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT4ROUTE_PIN_MASK               0xF0000UL                                     /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT4ROUTE_PIN_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT4ROUTE   */
#define GPIO_RFECA_DATAOUT4ROUTE_PIN_DEFAULT             (_GPIO_RFECA_DATAOUT4ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT4ROUTE*/

