espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_gpio.h
/* Bit fields for GPIO_RFECA DATAOUT5ROUTE */
#define _GPIO_RFECA_DATAOUT5ROUTE_RESETVALUE             0x00000000UL                                  /**< Default value for GPIO_RFECA_DATAOUT5ROUTE  */
#define _GPIO_RFECA_DATAOUT5ROUTE_MASK                   0x000F0003UL                                  /**< Mask for GPIO_RFECA_DATAOUT5ROUTE           */
#define _GPIO_RFECA_DATAOUT5ROUTE_PORT_SHIFT             0                                             /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT5ROUTE_PORT_MASK              0x3UL                                         /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT5ROUTE_PORT_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT5ROUTE   */
#define GPIO_RFECA_DATAOUT5ROUTE_PORT_DEFAULT            (_GPIO_RFECA_DATAOUT5ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT5ROUTE*/
#define _GPIO_RFECA_DATAOUT5ROUTE_PIN_SHIFT              16                                            /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT5ROUTE_PIN_MASK               0xF0000UL                                     /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT5ROUTE_PIN_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT5ROUTE   */
#define GPIO_RFECA_DATAOUT5ROUTE_PIN_DEFAULT             (_GPIO_RFECA_DATAOUT5ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT5ROUTE*/

/* Bit fields for GPIO_RFECA DATAOUT6ROUTE */
#define _GPIO_RFECA_DATAOUT6ROUTE_RESETVALUE             0x00000000UL                                  /**< Default value for GPIO_RFECA_DATAOUT6ROUTE  */
#define _GPIO_RFECA_DATAOUT6ROUTE_MASK                   0x000F0003UL                                  /**< Mask for GPIO_RFECA_DATAOUT6ROUTE           */
#define _GPIO_RFECA_DATAOUT6ROUTE_PORT_SHIFT             0                                             /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT6ROUTE_PORT_MASK              0x3UL                                         /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT6ROUTE_PORT_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT6ROUTE   */
#define GPIO_RFECA_DATAOUT6ROUTE_PORT_DEFAULT            (_GPIO_RFECA_DATAOUT6ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT6ROUTE*/
#define _GPIO_RFECA_DATAOUT6ROUTE_PIN_SHIFT              16                                            /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT6ROUTE_PIN_MASK               0xF0000UL                                     /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT6ROUTE_PIN_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT6ROUTE   */
#define GPIO_RFECA_DATAOUT6ROUTE_PIN_DEFAULT             (_GPIO_RFECA_DATAOUT6ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT6ROUTE*/

/* Bit fields for GPIO_RFECA DATAOUT7ROUTE */
#define _GPIO_RFECA_DATAOUT7ROUTE_RESETVALUE             0x00000000UL                                  /**< Default value for GPIO_RFECA_DATAOUT7ROUTE  */
#define _GPIO_RFECA_DATAOUT7ROUTE_MASK                   0x000F0003UL                                  /**< Mask for GPIO_RFECA_DATAOUT7ROUTE           */
#define _GPIO_RFECA_DATAOUT7ROUTE_PORT_SHIFT             0                                             /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT7ROUTE_PORT_MASK              0x3UL                                         /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT7ROUTE_PORT_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT7ROUTE   */
#define GPIO_RFECA_DATAOUT7ROUTE_PORT_DEFAULT            (_GPIO_RFECA_DATAOUT7ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT7ROUTE*/
#define _GPIO_RFECA_DATAOUT7ROUTE_PIN_SHIFT              16                                            /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT7ROUTE_PIN_MASK               0xF0000UL                                     /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT7ROUTE_PIN_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT7ROUTE   */
#define GPIO_RFECA_DATAOUT7ROUTE_PIN_DEFAULT             (_GPIO_RFECA_DATAOUT7ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT7ROUTE*/

/* Bit fields for GPIO_RFECA DATAOUT8ROUTE */
#define _GPIO_RFECA_DATAOUT8ROUTE_RESETVALUE             0x00000000UL                                  /**< Default value for GPIO_RFECA_DATAOUT8ROUTE  */
#define _GPIO_RFECA_DATAOUT8ROUTE_MASK                   0x000F0003UL                                  /**< Mask for GPIO_RFECA_DATAOUT8ROUTE           */
#define _GPIO_RFECA_DATAOUT8ROUTE_PORT_SHIFT             0                                             /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT8ROUTE_PORT_MASK              0x3UL                                         /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT8ROUTE_PORT_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT8ROUTE   */
#define GPIO_RFECA_DATAOUT8ROUTE_PORT_DEFAULT            (_GPIO_RFECA_DATAOUT8ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT8ROUTE*/
#define _GPIO_RFECA_DATAOUT8ROUTE_PIN_SHIFT              16                                            /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT8ROUTE_PIN_MASK               0xF0000UL                                     /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT8ROUTE_PIN_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT8ROUTE   */
#define GPIO_RFECA_DATAOUT8ROUTE_PIN_DEFAULT             (_GPIO_RFECA_DATAOUT8ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT8ROUTE*/

