espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_gpio.h
/* Bit fields for GPIO_RFECA DATAOUT9ROUTE */
#define _GPIO_RFECA_DATAOUT9ROUTE_RESETVALUE             0x00000000UL                                  /**< Default value for GPIO_RFECA_DATAOUT9ROUTE  */
#define _GPIO_RFECA_DATAOUT9ROUTE_MASK                   0x000F0003UL                                  /**< Mask for GPIO_RFECA_DATAOUT9ROUTE           */
#define _GPIO_RFECA_DATAOUT9ROUTE_PORT_SHIFT             0                                             /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT9ROUTE_PORT_MASK              0x3UL                                         /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT9ROUTE_PORT_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT9ROUTE   */
#define GPIO_RFECA_DATAOUT9ROUTE_PORT_DEFAULT            (_GPIO_RFECA_DATAOUT9ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT9ROUTE*/
#define _GPIO_RFECA_DATAOUT9ROUTE_PIN_SHIFT              16                                            /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT9ROUTE_PIN_MASK               0xF0000UL                                     /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT9ROUTE_PIN_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for GPIO_RFECA_DATAOUT9ROUTE   */
#define GPIO_RFECA_DATAOUT9ROUTE_PIN_DEFAULT             (_GPIO_RFECA_DATAOUT9ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT9ROUTE*/

/* Bit fields for GPIO_RFECA DATAOUT10ROUTE */
#define _GPIO_RFECA_DATAOUT10ROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_RFECA_DATAOUT10ROUTE */
#define _GPIO_RFECA_DATAOUT10ROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_RFECA_DATAOUT10ROUTE          */
#define _GPIO_RFECA_DATAOUT10ROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT10ROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT10ROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT10ROUTE  */
#define GPIO_RFECA_DATAOUT10ROUTE_PORT_DEFAULT           (_GPIO_RFECA_DATAOUT10ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT10ROUTE*/
#define _GPIO_RFECA_DATAOUT10ROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT10ROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT10ROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT10ROUTE  */
#define GPIO_RFECA_DATAOUT10ROUTE_PIN_DEFAULT            (_GPIO_RFECA_DATAOUT10ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT10ROUTE*/

/* Bit fields for GPIO_RFECA DATAOUT11ROUTE */
#define _GPIO_RFECA_DATAOUT11ROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_RFECA_DATAOUT11ROUTE */
#define _GPIO_RFECA_DATAOUT11ROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_RFECA_DATAOUT11ROUTE          */
#define _GPIO_RFECA_DATAOUT11ROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT11ROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT11ROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT11ROUTE  */
#define GPIO_RFECA_DATAOUT11ROUTE_PORT_DEFAULT           (_GPIO_RFECA_DATAOUT11ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT11ROUTE*/
#define _GPIO_RFECA_DATAOUT11ROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT11ROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT11ROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT11ROUTE  */
#define GPIO_RFECA_DATAOUT11ROUTE_PIN_DEFAULT            (_GPIO_RFECA_DATAOUT11ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT11ROUTE*/

/* Bit fields for GPIO_RFECA DATAOUT12ROUTE */
#define _GPIO_RFECA_DATAOUT12ROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_RFECA_DATAOUT12ROUTE */
#define _GPIO_RFECA_DATAOUT12ROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_RFECA_DATAOUT12ROUTE          */
#define _GPIO_RFECA_DATAOUT12ROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT12ROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT12ROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT12ROUTE  */
#define GPIO_RFECA_DATAOUT12ROUTE_PORT_DEFAULT           (_GPIO_RFECA_DATAOUT12ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT12ROUTE*/
#define _GPIO_RFECA_DATAOUT12ROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT12ROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT12ROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT12ROUTE  */
#define GPIO_RFECA_DATAOUT12ROUTE_PIN_DEFAULT            (_GPIO_RFECA_DATAOUT12ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT12ROUTE*/

