espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_gpio.h
/* Bit fields for GPIO_RFECA DATAOUT13ROUTE */
#define _GPIO_RFECA_DATAOUT13ROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_RFECA_DATAOUT13ROUTE */
#define _GPIO_RFECA_DATAOUT13ROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_RFECA_DATAOUT13ROUTE          */
#define _GPIO_RFECA_DATAOUT13ROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT13ROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT13ROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT13ROUTE  */
#define GPIO_RFECA_DATAOUT13ROUTE_PORT_DEFAULT           (_GPIO_RFECA_DATAOUT13ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT13ROUTE*/
#define _GPIO_RFECA_DATAOUT13ROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT13ROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT13ROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT13ROUTE  */
#define GPIO_RFECA_DATAOUT13ROUTE_PIN_DEFAULT            (_GPIO_RFECA_DATAOUT13ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT13ROUTE*/

/* Bit fields for GPIO_RFECA DATAOUT14ROUTE */
#define _GPIO_RFECA_DATAOUT14ROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_RFECA_DATAOUT14ROUTE */
#define _GPIO_RFECA_DATAOUT14ROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_RFECA_DATAOUT14ROUTE          */
#define _GPIO_RFECA_DATAOUT14ROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT14ROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT14ROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT14ROUTE  */
#define GPIO_RFECA_DATAOUT14ROUTE_PORT_DEFAULT           (_GPIO_RFECA_DATAOUT14ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT14ROUTE*/
#define _GPIO_RFECA_DATAOUT14ROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT14ROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT14ROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT14ROUTE  */
#define GPIO_RFECA_DATAOUT14ROUTE_PIN_DEFAULT            (_GPIO_RFECA_DATAOUT14ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT14ROUTE*/

/* Bit fields for GPIO_RFECA DATAOUT15ROUTE */
#define _GPIO_RFECA_DATAOUT15ROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_RFECA_DATAOUT15ROUTE */
#define _GPIO_RFECA_DATAOUT15ROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_RFECA_DATAOUT15ROUTE          */
#define _GPIO_RFECA_DATAOUT15ROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT15ROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT15ROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT15ROUTE  */
#define GPIO_RFECA_DATAOUT15ROUTE_PORT_DEFAULT           (_GPIO_RFECA_DATAOUT15ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT15ROUTE*/
#define _GPIO_RFECA_DATAOUT15ROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT15ROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT15ROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT15ROUTE  */
#define GPIO_RFECA_DATAOUT15ROUTE_PIN_DEFAULT            (_GPIO_RFECA_DATAOUT15ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT15ROUTE*/

/* Bit fields for GPIO_RFECA DATAOUT16ROUTE */
#define _GPIO_RFECA_DATAOUT16ROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_RFECA_DATAOUT16ROUTE */
#define _GPIO_RFECA_DATAOUT16ROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_RFECA_DATAOUT16ROUTE          */
#define _GPIO_RFECA_DATAOUT16ROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT16ROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT16ROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT16ROUTE  */
#define GPIO_RFECA_DATAOUT16ROUTE_PORT_DEFAULT           (_GPIO_RFECA_DATAOUT16ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT16ROUTE*/
#define _GPIO_RFECA_DATAOUT16ROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT16ROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT16ROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT16ROUTE  */
#define GPIO_RFECA_DATAOUT16ROUTE_PIN_DEFAULT            (_GPIO_RFECA_DATAOUT16ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT16ROUTE*/

