espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_gpio.h
/* Bit fields for GPIO_RFECA DATAOUT17ROUTE */
#define _GPIO_RFECA_DATAOUT17ROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_RFECA_DATAOUT17ROUTE */
#define _GPIO_RFECA_DATAOUT17ROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_RFECA_DATAOUT17ROUTE          */
#define _GPIO_RFECA_DATAOUT17ROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT17ROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT17ROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT17ROUTE  */
#define GPIO_RFECA_DATAOUT17ROUTE_PORT_DEFAULT           (_GPIO_RFECA_DATAOUT17ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT17ROUTE*/
#define _GPIO_RFECA_DATAOUT17ROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT17ROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT17ROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT17ROUTE  */
#define GPIO_RFECA_DATAOUT17ROUTE_PIN_DEFAULT            (_GPIO_RFECA_DATAOUT17ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT17ROUTE*/

/* Bit fields for GPIO_RFECA DATAOUT18ROUTE */
#define _GPIO_RFECA_DATAOUT18ROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_RFECA_DATAOUT18ROUTE */
#define _GPIO_RFECA_DATAOUT18ROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_RFECA_DATAOUT18ROUTE          */
#define _GPIO_RFECA_DATAOUT18ROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAOUT18ROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAOUT18ROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT18ROUTE  */
#define GPIO_RFECA_DATAOUT18ROUTE_PORT_DEFAULT           (_GPIO_RFECA_DATAOUT18ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT18ROUTE*/
#define _GPIO_RFECA_DATAOUT18ROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAOUT18ROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAOUT18ROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAOUT18ROUTE  */
#define GPIO_RFECA_DATAOUT18ROUTE_PIN_DEFAULT            (_GPIO_RFECA_DATAOUT18ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAOUT18ROUTE*/

/* Bit fields for GPIO_RFECA DATAVALIDROUTE */
#define _GPIO_RFECA_DATAVALIDROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_RFECA_DATAVALIDROUTE */
#define _GPIO_RFECA_DATAVALIDROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_RFECA_DATAVALIDROUTE          */
#define _GPIO_RFECA_DATAVALIDROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_DATAVALIDROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_DATAVALIDROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAVALIDROUTE  */
#define GPIO_RFECA_DATAVALIDROUTE_PORT_DEFAULT           (_GPIO_RFECA_DATAVALIDROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAVALIDROUTE*/
#define _GPIO_RFECA_DATAVALIDROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_DATAVALIDROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_DATAVALIDROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_DATAVALIDROUTE  */
#define GPIO_RFECA_DATAVALIDROUTE_PIN_DEFAULT            (_GPIO_RFECA_DATAVALIDROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_DATAVALIDROUTE*/

/* Bit fields for GPIO_RFECA TRIGGERINROUTE */
#define _GPIO_RFECA_TRIGGERINROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_RFECA_TRIGGERINROUTE */
#define _GPIO_RFECA_TRIGGERINROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_RFECA_TRIGGERINROUTE          */
#define _GPIO_RFECA_TRIGGERINROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_RFECA_TRIGGERINROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_RFECA_TRIGGERINROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_TRIGGERINROUTE  */
#define GPIO_RFECA_TRIGGERINROUTE_PORT_DEFAULT           (_GPIO_RFECA_TRIGGERINROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_RFECA_TRIGGERINROUTE*/
#define _GPIO_RFECA_TRIGGERINROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_RFECA_TRIGGERINROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_RFECA_TRIGGERINROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_RFECA_TRIGGERINROUTE  */
#define GPIO_RFECA_TRIGGERINROUTE_PIN_DEFAULT            (_GPIO_RFECA_TRIGGERINROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_RFECA_TRIGGERINROUTE*/

